## 命令简介
cd（Change Directory），用来切换工作目录至指定的目录。 

指定的目录可以是绝对路径或相对路径。若指定目录名称省略，则直接切换至当前用户的home directory（也就是刚login时所在的目录）。另外，~ 也表示为 home directory 的意思，. 则是表示目前所在的目录，… 则表示目前目录位置的上一层目录。

## 命令格式
```
cd [-L|-P] [DIR]
```
## 参数说明
```
-p
	#如果要切换到的目标目录是一个符号连接，直接切换到符号连接指向的目标目录
-L
	#如果要切换的目标目录是一个符号的连接，直接切换到字符连接名代表的目录，而非符号连接所指向的目标目录。
-
	#当仅使用一个横杠-时，切换到环境变量OLDPWD所表示的目录
--
	#两个横杠，切换到用户家目录
```
## 常用示例
1、切换至上一级目录。
```
cd ..
```
2、切换至根目录。
```
cd /
```
3、回到上次使用的目录。
```
cd –
```
4、回到用户家目录。
```
cd ~ 或  cd --
还可以使用绝对路径 cd /home/user_name/
cd /home/mingongge/    #切换到用户为mingongge的家目录
但是root用户除外，它的家目录就是/root
```
5、返回上两级目录
```
cd ../..  
```
6、把上个命令的参数作为cd参数使用
```
cd !$  
```
cd命令可以说是Linux中最基本的命令语句，其他的命令语句要进行操作，都是建立在使用 cd命令上的。所以，学习Linux常用命令，首先就要学好cd命令的使用方法技巧。
